cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "homebrew/php"
tap "jmalloc/grit"

# Install Binaries
brew "awscli"
brew "bash-completion"
brew "colordiff"
brew "composer"
brew "ghi"
brew "git"
brew "go"
brew "gpg"
brew "grit"
brew "hub"
brew "jq"
brew "mas"
brew "node"
brew "php71-intl"
brew "php71"
brew "watch"
brew "wget"
brew "yarn"

# Install Apps
cask "1password-cli"
cask "dropbox"
cask "google-chrome"
cask "atom"
cask "docker"

# Install App Store Apps
mas "1Password", id: 443987910
mas "Slack", id: 803453959
