cask_args appdir: "/Applications"

tap "caskroom/cask"
tap "homebrew/bundle"
tap "homebrew/core"
tap "jmalloc/grit"

# Install Binaries
brew "awscli"
brew "bash-completion"
brew "colordiff"
brew "composer"
brew "git"
brew "go"
brew "gpg"
brew "grit"
brew "hub"
brew "jq"
brew "protobuf"
brew "node"
brew "watch"
brew "wget"
brew "yarn"
brew "cfssl"
brew "php@7.0"

# Install Apps
cask "1password-cli"
cask "dropbox"
cask "google-chrome"
cask "docker"
cask "visual-studio-code"

# MAS does not currently work on Mojave, it seems.
#
# mas "1Password 7", id: 1333542190
# mas "Fusion360", id: 868968810
# mas "Magnet", id: 441258766
# mas "Slack", id: 803453959
