cask_args appdir: "/Applications"

tap "datawire/blackbird"
tap "homebrew/cask-fonts"
tap "jmalloc/grit"
tap "ktr0731/evans"
tap "remotemobprogramming/brew"

# Install Binaries
brew "awscli"
brew "clang-format" # needed for VSCode protobuf extension to support formatting
brew "composer"
brew "direnv"
brew "evans"
brew "git"
brew "go"
brew "graphviz"
brew "grit"
brew "helm"
brew "jq"
brew "kubectx"
brew "kubernetes-cli"
brew "less" # required for the --quit-if-one-screen option to work properly
brew "mas"
brew "mob"
brew "node"
brew "pgcli"
brew "php"
brew "telepresence-arm64"
brew "terraform"
brew "vale"
brew "watch"
brew "yarn"

# Install Apps
cask "1password-cli"
cask "1password"
cask "around"
cask "docker"
cask "visual-studio-code"

# Install Apps form the App Store
mas "Magnet", id: 441258766
mas "Parcel", id: 639968404
mas "Slack", id: 803453959

# Install Fonts
cask "font-meslo-for-powerline"
