cask_args appdir: "/Applications"

tap "datawire/blackbird"
tap "homebrew/cask-fonts"
tap "jmalloc/grit"
tap "ktr0731/evans"

# Install Binaries
brew "awscli"
brew "composer"
brew "evans"
brew "git"
brew "gnupg"
brew "go"
brew "graphviz"
brew "grit"
brew "helm"
brew "jq"
brew "kubectx"
brew "kubernetes-cli@1.22" # pinned at this version for compatibility with EKS
brew "less" # required for the --quit-if-one-screen option to work properly
brew "mas"
brew "node"
brew "pgcli"
brew "php"
brew "pinentry-mac"
brew "telepresence-arm64"
brew "terraform"
brew "yarn"

# Install Apps
cask "1password-cli"
cask "docker"
cask "google-chrome"
cask "kicad"
cask "visual-studio-code"

# Install Apps form the App Store
mas "1Password 7", id: 1333542190
mas "Brother P-touch Editor", id: 1453365242
mas "Logic Pro", id: 634148309
mas "Magnet", id: 441258766
mas "Parcel", id: 639968404
mas "Slack", id: 803453959

# Install Fonts
cask "font-meslo-for-powerline"
